app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'e.taibagarov@zlatar12.com'
 LIMIT 1
---
    public function check(){
      $validation = $this->validate([
                                      'email' => [
                                                    'rules' => 'required|valid_email|is_not_unique[users.email]',
                                                    'errors' => ['required'=>'Email is required',
                                                                'valid_email'=> 'VALID email is required',
                                                                'is_not_unique' => 'This email is not registered'
                                                               ]
                                                  ],
                                      'password' => [
                                                    'rules' => 'required|min_length[5]|max_length[12]',
                                                    'errors' => ['required'=>'Password is required',
                                                                'min_length'=> 'Password must have atleast 5 characters in length',
                                                                'max_length' => 'Password must not have characters more than 12 in length'
                                                               ]
                                                    ]
                                    ]);
      if(!$validation){
        echo view('partials/_header');
        echo view('auth/login', ['validation'=>$this->validator]);
        echo view('partials/_footer');

      }else{
        $email = $this->request->getPost('email');
        $psw = $this->request->getPost('password');

        $usersModel = new \App\Models\UsersModel();
        $user_info = $usersModel->where('email', $email)->first();