app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function index()
    {
        $usersModel = new \App\Models\UsersModel();
        $financeModel = new \App\Models\FinanceModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserID);